## Ejercicio - pandas 3

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Versiones

print(f"numpy=={np.__version__}")
print(f"pandas=={pd.__version__}")

numpy==2.2.1
pandas==2.2.3

### Ejercicio 0:
- Carga ambos archivos **titanic_1.csv** y **titanic_2.csv** y guardalos en **df1** y **df2** respectivamente:

In [9]:
df1 = pd.read_csv('../Data/titanic_1.csv')
df2 = pd.read_csv('../Data/titanic_2.csv')

### Ejercicio 1:
- Mostrar las estadisticas de cada uno de los DataFrames.

In [6]:
df1.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
PassengerId,891.0,NaN,NaN,NaN,446.0,257.353842,1.0,223.5,446.0,668.5,891.0
Name,891,891,"Dooley, Mr. Patrick",1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Sex,891,2,male,577,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,714.0,NaN,NaN,NaN,29.699118,14.526497,0.42,20.125,28.0,38.0,80.0

In [7]:
df2.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
PassengerId,890.0,NaN,NaN,NaN,446.5,257.065167,2.0,224.25,446.5,668.75,891.0
Survived,890.0,NaN,NaN,NaN,0.38427,0.486696,0.0,0.0,0.0,1.0,1.0
Pclass,890.0,NaN,NaN,NaN,2.307865,0.83622,1.0,2.0,3.0,3.0,3.0
Ticket,890,680,CA. 2343,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Fare,890.0,NaN,NaN,NaN,32.232246,49.714317,0.0,7.925,14.4542,31.0,512.3292

### Ejercicio 2:
- Unir los DataFrames para obtener solo uno.

In [10]:
df = pd.merge(df1, df2)
df.head(2)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833

In [12]:
df = pd.merge(left = df1, right = df2, left_on = "PassengerId", right_on = "PassengerId", how = "inner")
df.head(2)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833

### Ejercicio 3:
- Imprimir las últimas 5 filas de las columnas de nombre y edad

In [14]:
df[['Name', 'Age']].tail(5)

                                         Name   Age
886                     Montvila, Rev. Juozas  27.0
887              Graham, Miss. Margaret Edith  19.0
888  Johnston, Miss. Catherine Helen "Carrie"   NaN
889                     Behr, Mr. Karl Howell  26.0
890                       Dooley, Mr. Patrick  32.0

### Ejercicio 4:
- Imprimir las primeras 10 filas de las instancias que en sexo sean igual a femenino.

In [15]:
df[df['Sex'] == 'female'].head(10)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
10,11,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,3,PP 9549,16.7000
11,12,"Bonnell, Miss. Elizabeth",female,58.0,1,1,113783,26.5500
14,15,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,3,350406,7.8542
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,1,2,248706,16.0000
18,19,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,0,3,345763,18.0000

### Ejercicio 5:
- Imprimir las instancias que en la columna **Fare** sean menor a 33 y en la columna **Pclass** igual a 2.

In [18]:
df_cheap = df[(df['Fare'] < 33) & (df['Pclass'] == 2)]
df_cheap.head(3)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,1,2,248706,16.0000
17,18,"Williams, Mr. Charles Eugene",male,NaN,1,2,244373,13.0000

### Ejercicio 6:
- Del resultado anterior obten el número de hombres y el número de mujeres.

In [19]:
df_cheap['Sex'].value_counts()

Sex
male      95
female    68
Name: count, dtype: int64

### Ejercicio 7:
- Obten el costo total de los tickets de hombres y el costo total de los tickets de mujeres.

In [ ]:
# filtrar por female y hacer sum en columna Fare

# filtrar por male y hacer sum en columna Fare

# no hace falta groupby

### Ejercicio 8:
- Obten el costo total de los tickets por cada clase (1, 2 y 3) y el número de pasajeros de cada clase.

### Ejercicio 9:
- Crear una columna con el apellido de cada pasajero y agregala al DataFrame.

### Ejercicio 10:
- Encuentra si se repiten apellidos en la columna que se creo en el ejercicio anterior. (Usa _**.value_counts()**_)

### Ejercicio 11:
- Encuentra los apellidos que se repiten en la columna recien creada. Es decir, solo muestra los apellidos que aparecen más de 1 vez.

### Ejercicio 12:
- Imprime los primeros 10 pasajeros que tengan un **PassengerID** multiplo de 3.

### Ejercicio 13:
- ¿Cuales son los apellidos de los pasajeros que son mujeres y menores de 20 años?

### Ejercicio 14:
- ¿Cuales son los apellidos de los pasajeros que son hombres y mayor de 45 años?

### Ejercicio 15:
- Compara si coinciden los apellidos generados en los ejercicios anteriores.

### Ejercicio 16:
- Encuentra los 10 pasajeros que no sobrevivieron más jovenes e imprime cuantos son hombres y cuantos son mujeres.

### Ejercicio 17:
-  En un DataFrame muestra 3 pasajeros que sean hombres y 3 que sean mujeres, que hayan sobrevivido y para cada clase de la columna **Pclass**.

### Ejercicio 18:
- Obtener el tipo de elementos de cada columna y convierte los que sean "int64" a "int32". Evalua la memoria que consume antes y después de convertir las columnas y comenta la diferencia.

### Ejercicio 19:
- Encuentra a los pasajeros de la clase 1 y 3 entre 20 y 25 años y comprueba si son más hombres o mujeres.

### Ejercicio 20:
- Agrega una nueva columna al DataFrame que se llame: "Rango edad" y va a categorizar de la siguiente manera:
    - Niño < 11 años
    - Joven < 18 años
    - Adulto < 50 años
    - Mayor >= 50 años

In [24]:
def rango_edad(edad):
    
    if edad < 11:
        return "niño"
    elif edad < 18:
        return "joven"
    elif edad < 50:
        return "adulto"
    else:
        return "mayor"


df['age_range'] = df['Age'].apply(rango_edad)
df.head(4)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,age_range
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500,adulto
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833,adulto
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250,adulto
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000,adulto

### Ejercicio 21:
- Encontrar a los pasajeros "jovenes" y "mayores" de la clase 2 y 3 que hayan sobrevivido. Imprimir los 10 primeros.

### Ejercicio 22:
- Encuentra la edad promedio de todos los pasajeros y reemmplazala por los **NaN** en la columna de **Age** y ejecuta el ejercicio anterior.

In [ ]:
# fillna

### Ejercicio 23:
- Cambia a español la columna **Sex**.

### Ejercicio 24:
- Convierte a mayusculas todas las columnas que los valores sean cadenas.

In [34]:
df.dtypes.to_dict().items()

dict_items([('PassengerId', dtype('int64')), ('Name', dtype('O')), ('Sex', dtype('O')), ('Age', dtype('float64')), ('Survived', dtype('int64')), ('Pclass', dtype('int64')), ('Ticket', dtype('O')), ('Fare', dtype('float64')), ('age_range', dtype('O'))])

In [31]:
# for nombre_columna, tipo_dato in df.dtypes.to_dict().items():
for llave, valor in df.dtypes.to_dict().items():
    # print(llave)
    # print(valor)
    if valor == 'object':
        print(f"Columna {llave} es de tipo cadena texto")
        df[llave] = df[llave].apply(lambda cadena: cadena.upper())
    # if para detectar si valor es object
        # df llave apply con upper()

Columna Name es de tipo cadena texto
Columna Sex es de tipo cadena texto
Columna Ticket es de tipo cadena texto
Columna age_range es de tipo cadena texto

In [32]:
df.head(5)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,age_range
0,1,"BRAUND, MR. OWEN HARRIS",MALE,22.0,0,3,A/5 21171,7.2500,ADULTO
1,2,"CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...",FEMALE,38.0,1,1,PC 17599,71.2833,ADULTO
2,3,"HEIKKINEN, MISS. LAINA",FEMALE,26.0,1,3,STON/O2. 3101282,7.9250,ADULTO
3,4,"FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)",FEMALE,35.0,1,1,113803,53.1000,ADULTO
4,5,"ALLEN, MR. WILLIAM HENRY",MALE,35.0,0,3,373450,8.0500,ADULTO

### Ejercicio 25:
- Agrupa por sexo y rango de edad y encuentra la edad promedio.

### Ejercicio 26:
- Divide la columna name en las siguientes columnas:
    - Mrs/Miss
    - Apellido
    - Nombre(s)
    
**Nota: Ignora el resto de información.**

In [ ]:
################################################################################################################################